package com.evgeniyfedorchenko.gptbot.yandex.model;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * История сообщений. Тот контекст, который должна "помнить" модель. Нужно передавать его в каждом запросе
 *
 * @param role Роль отправителя данного сообщения. Чтоб модель понимала, что отвечала она, а что юзер
 * @param text Текстовое содержимое сообщения
 */
public record GptMessageUnit(String role, String text) {

    /**
     * Идентификаторы отправителей сообщений. Передаются в объекте {@link GptMessageUnit}. Чтоб модель видела
     * что спрашивал сам юзер и что отвечала она - контекст и отталкивалась от него в будущих ответах<br>
     * <b>Важно!</b><br>
     * Модель понимает на входе только роли, представленные в нижнем регистре. При отправке роли в верхнем регистре
     * будет получена ошибка. Для установки корректного значения используйте предоставленный геттер
     */
    @Getter
    @AllArgsConstructor
    public enum Role {

        /**
         * Роль для отправки пользовательских сообщений к модели
         */
        USER("user"),

        /**
         * Используется для ответов, которые генерирует модель. Ответы модели, помеченные
         * ролью {@code assistant} включаются в состав сообщения для сохранения контекста
         * беседы. Не передавайте сообщения пользователя с этой ролью.
         */
        ASSISTANT("assistant"),

        /**
         * Системная роль, используется один раз в начале диалога и позволяет
         * задать контекст запроса и определить поведение модели
         */
        SYSTEM("system");

        private final String role;

    }

}
