package com.evgeniyfedorchenko.gptbot.yandex.model;

import lombok.Builder;
import lombok.Getter;

import java.util.List;

/**
 * Класс представляет собой тело запроса, который направляется на обработку модели {@code YandexGPT}
 */
@Getter
@Builder
public class GptRequestBody {

    /**
     * Внутренний адрес модели Яндекса.
     * Параметр {@code <your-yandex-folder-id>} содержит идентификатор каталога Yandex Cloud
     *
     * @example {@code "gpt://a2gmcltgwefld9t36qwe/yandexgpt}
     */
    private final String modelUri;

    /**
     * Предпочтительные параметры конфигурации ответа: режим потока, температура, ограничение по токенам
     */
    @Builder.Default
    private final CompletionOptions completionOptions = CompletionOptions.builder().build();

    /**
     * История переписки с моделью, которую должна "помнить" модель для ведения диалога
     */
    private final List<GptMessageUnit> messages;

    /**
     * Технические настройки желаемого ответа
     */
    @Getter
    @Builder
    public static final class CompletionOptions {

        /**
         * Режим потока - включает потоковую передачу частично сгенерированного текста.
         */
        @Builder.Default
        private final boolean stream = false;

        /**
         * Мера непредсказуемости/креативности. Чем выше значение этого параметра, тем более креативными и
         * случайными будут ответы модели. Принимает число от нуля до единицы, обе границы включительно
         */
        @Builder.Default
        private final double temperature = 0.5D;

        /**
         * Устанавливает ограничение на выход модели в токенах, подробнее см. <a href="https://yandex.cloud/ru/docs/foundation-models/concepts/limits">Квоты и лимиты в Yandex Foundation Models</a>
         */
        @Builder.Default
        private final int maxTokens = 2000;

    }
}

/*

{
    "modelUri": "gpt://a2gmcltgwefld9t36qwe/yandexgpt",
    "completionOptions": {
        "stream": false,
        "temperature": 0.6,
        "maxTokens": "2000"
    },
    "messages": [
        {
            "role": "system",
            "text": "Ты умный ассистент"
        },
        {
            "role": "user",
            "text": "Привет! Какими науками занимался Альберт Эйнштейн?"
        },
        {
            "role": "assistant",
            "text": "Альберт Эйнштейн был выдающимся физиком, труды которого в области теоретической физики, теоретической механики и философии науки стали фундаментальными. Он посвятил свою карьеру изучению основ Вселенной, включая теорию относительности, специальную и общую теорию относительности. Кроме того, Альберт Эйнштейн изучал:\n\n* термодинамику,\n* статистическую механику,\n* электромагнетизм,\n* квантовую теорию,\n* специальную теорию относительности и др.\n\nЕго работы по общей теории относительности получили широкое признание и оказали глубокое влияние на развитие современной физики."
        },
        {
            "role": "user",
            "text": "Какие важные открытия он совершил?"
        },
        {
            "role": "assistant",
            "text": "Вот некоторые открытия, которые обычно связывают с именем Альберта Эйнштейна:\n1. **Специальная теория относительности (СТО)** — теория, описывающая движение, законы механики и пространственно-временные отношения при произвольных скоростях, меньших скорости света в вакууме.\n1. **Общая теория относительности (ОТО)** — геометрическая теория тяготения, основанная на предсказании взаимосвязи между координатами пространства-времени, материи и энергии.\n1. **Квантовая теория фотоэффекта** — объяснение фотоэффекта, явления выбивания электронов из вещества под действием электромагнитного излучения.\n1. **Броуновское движение** — явление беспорядочного, случайного движения микроскопических частиц, взвешенных в жидкости или газе, происходящее из-за теплового движения молекул окружающей среды.\n1. **Эквивалентность гравитационной и инерционной массы** — идея о том, что гравитационная и инертная масса являются разными аспектами одной и той же величины.\n1. **Космологические решения уравнений ОТО** — вклад в теорию строения и динамики Вселенной.\n1. **Ядерная модель атома** — описание структуры атома на основе протонов, нейтронов и электронов.\nЭто лишь некоторые из открытий Альберта Эйнштейна. Его вклад в науку и философию огромен, и его исследования продолжают оказывать влияние на наши представления о природе и Вселенной."
        }
    ]
}

*/