package com.efedorchenko.gptbot.service;

import lombok.AllArgsConstructor;
import lombok.Getter;

@Getter
@AllArgsConstructor
public enum DefaultAnswers {

    START_COMMAND_ANSWER("Привет, как жизнь? \uD83D\uDC4B\nИспользуй команды слева от поля ввода и вперед!\nРежим по умолчанию: *GPT*"),
    HELP_COMMAND_ANSWER("""
                *Нейрон GPT v. 0.0.2*
                                
                Привет! Это Telegram-бот центра ИИ [Нейрон](https://aiperm.ru/) 😎
                                
                Он основан на современных моделях искусственного интеллекта и готов помочь тебе в решении ваших задач! Чтобы выбрать режим, воспользуйся кнопками слева от поля ввода:
                                
                - *Режим gpt* 💬
                Включен по умолчанию. Подходит для использования языковой модели в режиме чата. Ты можешь задавать вопросы и получать ответы от нейросети. Она запоминает контекст разговора и может помочь во многих вопросах (используй ее как будто это обычный чат).
                                
                - *Режим art* 🌌
                Режим для создания изображений. Подготовь одно сообщение (промпт) и опиши в нем, что ты хочешь получить, затем отправь его и подожди a little bit. Когда изображение будет готово, ты сможешь получить его прямо в этом чате, я буду держать тебя в курсе прогресса. Если тебя не устроил результат, попробуй изменить описание и повтори попытку. Подробнее о том, как лучше всего составлять промпты: %s.
                                
                Мы собираемся улучшать эти модели и добавить новые в будущем, так что следи за обновлениями!
                И это, если обнаружишь ошибку... что ж, ты неплохо постарался, потому что мы не смогли этого сделать! Используй /feedback, чтобы сообщить нам об этом, и мы исправим ее в будущих версиях.
                                
                Если у тебя есть еще какие-либо вопросы или предложения, просто напиши нам несколько строк здесь: @AzorAhai777 или @alexsubbotinn
                                
                Удачи! ⭐️
                """),

    FEEDBACK_COMMAND_ANSWER("""
                Ого, ты очень крут! Если тебе есть что сказать, обязательно напиши нам, например ты можешь:
                - Поделиться пожеланиями по улучшению
                - Просто оставить отзыв
                - Задать вопрос
                - Рассказать о неисправности
                                
                Не стесняйся и обязательно напиши сюда: @AzorAhai777 или сюда: @alexsubbotinn
                                
                Thank you bro!
                """);



    private final String answer;

}
